Revit 2024 API
UnitUtils Class
 A utility class of functions related to units.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public static class UnitUtils
Visual Basic
Public NotInheritable Class UnitUtils
Visual C++
public ref class UnitUtils abstract sealed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.UnitUtils
See Also
UnitUtils Members
Autodesk.Revit.DB Namespace